# Brewfile - Updated: 2026-03-10 11:09:33
# Generated by brew-maintainer

tap "azure/azd"
tap "fluxcd/tap"
tap "grafana/grafana"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "oncletom/cpdf"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Testing and linting Helm charts
brew "chart-testing"
# General purpose syntax highlighter in pure Go
brew "chroma"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tool for exploring each layer in a docker image
brew "dive"
# CLI utility to build and manage a PKI CA
brew "easy-rsa"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Asynchronous event library
brew "libevent"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Command-line tool for managing and automating Grafana dashboards
brew "grizzly"
# Kubernetes package manager
brew "helm"
# Tool for automatically generating markdown documentation for helm charts
brew "helm-docs"
# GNU utilities for networking
brew "inetutils"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Package manager for Jsonnet
brew "jsonnet-bundler"
# Handy way to save and run project-specific commands
brew "just"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Simple terminal UI for git commands
brew "lazygit"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Package manager for the Lua programming language
brew "luarocks"
# Make/rake-like build tool using Go
brew "mage"
# Utility for directing compilation
brew "make"
# CLI for interacting with Grafana Mimir
brew "mimirtool"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@16"
# Theme for zsh
brew "powerlevel10k"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# RC file (dotfile) management
brew "rcm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Graphic adventure game interpreter
brew "scummvm"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# BDD unit testing framework for dash, bash, ksh, zsh and all POSIX shells
brew "shellspec"
# Autoformat shell script source code
brew "shfmt"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Config manager based on git
brew "vcsh"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Convert HTML to PDF
brew "weasyprint"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Language Server for Yaml Files
brew "yaml-language-server"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Azure Developer CLI
brew "azure/azd/azd"
# Flux CLI
brew "fluxcd/tap/flux"
# Vendor-agnostic OpenTelemetry Collector distribution with programmable pipelines
brew "grafana/grafana/alloy"
# Terraform
brew "hashicorp/tap/terraform"
# Coherent PDF Command-line Tools to modify PDF files
brew "oncletom/cpdf/cpdf"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Chromium based browser
cask "arc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Universal chat app powered by Matrix
cask "beeper"
# App to write and organise your ideas
cask "capacities"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Write, edit, and chat about your code with AI
cask "cursor"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Control your Elgato key lights
cask "elgato-control-center"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
cask "font-hurmit-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Grammarly for desktop
cask "grammarly-desktop"
# Desktop automation application
cask "hammerspoon"
# Companion app for Home Assistant home automation software
cask "home-assistant"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to manage software development and track bugs
cask "linear-linear"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Whisper dictation/transcription app
cask "opensuperwhisper"
# G-code generator for 3D printers
cask "orcaslicer"
# Install games and apps compiled for Microsoft Windows
cask "porting-kit"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Virtual machines UI using QEMU
cask "utm"
# GUI for the Neovim text editor
cask "vimr"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
vscode "aaron00101010.diff-panel"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "bito.bito"
vscode "caarlos0.language-prometheus"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grafana.grafana-alloy"
vscode "grafana.grafana-vscode"
vscode "hashicorp.terraform"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "nicollasr.vscode-streamdeck"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "rogalmic.zsh-debug"
vscode "shakram02.bash-beautify"
vscode "vscodevim.vim"
go "github.com/rhysd/actionlint/cmd/actionlint"
go "golang.org/x/tools/gopls"
go "github.com/client9/misspell/cmd/misspell"
go "honnef.co/go/tools/cmd/staticcheck"
