# Brewfile - Updated: 2026-03-22 08:15:20
# Generated by brew-maintainer

tap "fluxcd/tap"
tap "grafana/grafana"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "oncletom/cpdf"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Tool for automatically generating markdown documentation for helm charts
brew "helm-docs"
# GNU utilities for networking
brew "inetutils"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Package manager for Jsonnet
brew "jsonnet-bundler"
# Handy way to save and run project-specific commands
brew "just"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# CLI for interacting with Grafana Mimir
brew "mimirtool"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# OpenShift command-line interface tools
brew "openshift-cli"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# RC file (dotfile) management
brew "rcm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# BDD unit testing framework for dash, bash, ksh, zsh and all POSIX shells
brew "shellspec"
# Autoformat shell script source code
brew "shfmt"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Config manager based on git
brew "vcsh"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Convert HTML to PDF
brew "weasyprint"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Language Server for Yaml Files
brew "yaml-language-server"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Flux CLI
brew "fluxcd/tap/flux"
# Terraform
brew "hashicorp/tap/terraform"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Chromium based browser
cask "arc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Universal chat app powered by Matrix
cask "beeper"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Write, edit, and chat about your code with AI
cask "cursor"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
cask "font-hack-nerd-font"
cask "font-hurmit-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Grammarly for desktop
cask "grammarly-desktop"
# Companion app for Home Assistant home automation software
cask "home-assistant"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# G-code generator for 3D printers
cask "orcaslicer"
# Install games and apps compiled for Microsoft Windows
cask "porting-kit"
# Team communication and collaboration software
cask "slack"
# GUI for the Neovim text editor
cask "vimr"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
vscode "aaron00101010.diff-panel"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anysphere.cursorpyright"
vscode "anysphere.pyright"
vscode "bierner.markdown-preview-github-styles"
vscode "caarlos0.language-prometheus"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grafana.grafana-alloy"
vscode "grafana.grafana-vscode"
vscode "hashicorp.terraform"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "nicollasr.vscode-streamdeck"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "rogalmic.zsh-debug"
vscode "shakram02.bash-beautify"
vscode "vscodevim.vim"
go "github.com/grafana/mcp-grafana/cmd/mcp-grafana"
